
# üìò Desafio de Redes ITEP  
**Projeto:** Configura√ß√£o de Switch Camada 3 com VLANs, ACLs, DHCP e DNS

---

## üß∞ Equipamentos Utilizados

- **Switch Cisco 3650-24PS**  
  - Switch de Camada 3 (Layer 3);
  - 24 portas Ethernet 10/100/1000 com PoE+;
  - 4 portas SFP para uplink (1 Gbps);
  - Suporte a PoE+ (at√© 30W por porta, total de 390W);
  - Capacidade de empilhamento (StackWise-160) at√© 9 switches;
  - Capacidade de comuta√ß√£o: 88 Gbps;
  - Controlador wireless integrado (at√© 50 APs e 1000 clientes);
  - Fonte de alimenta√ß√£o modular e redundante;
  - Mem√≥ria RAM: 4 GB | Flash: 2 GB;
  - Tamanho: 1U rack | Peso: ~17,5 kg;
 
- **Datacenter - Servidor Web**
  - CPU Intel Xeon ou AMD EPYC (m√≠nimo 4 n√∫cleos, ideal 8+);
  - 32GB (M√≠nimo) de Mem√≥ria RAM DDR5;
  - SSD NVMe de 01TB ou superior;
  - Placa de rede 10 Gbps;
  - Fonte redundante;
  - Sistema operacional Linux (Ubuntu Server, Debian ou CentOS)
  
- **Notebooks TI**  
  - CPU Intel Core i5 de 13a Gera√ß√£o ou superior;
  - 16 GB de mem√≥ria RAM DDR5;
  - SSD NVMe de 480GB ou superior;
  - USB 3.2 Gen 1 ou superior, USB tipo C + Display Port 2.1;
  - Rede Fast Ethernet Gigabite 10/100/1000;
  - Teclado ABNT2 com parte n√∫merica;
  - Sistema Operacional Windows 11 PRO.

- **PCS ADM**  
  - CPU Intel i3 de 13a Gera√ß√£o ou superior;
  - 08 GB de mem√≥ria RAM DDR5;
  - SSD NVMe de 480GB ou superior;
  - Placa m√£e com no m√≠nimo 04 portas USB 3.0;
  - Rede integrada Fast Ethernet Gigabite 10/100/1000;
  - Fonte de alimenta√ß√£o de 400W ou superior com PFC ativo e prote√ß√£o contra sub e sobre Tens√£o;
  - Sistema Operacional Windows 11 PRO.

- **PCS LABORAT√ìRIO DE PESQUISA**  
  - CPU Intel i5 de 13a Gera√ß√£o ou superior;
  - 16 GB de mem√≥ria RAM DDR5;
  - SSD NVMe de 01TB;
  - Placa m√£e com no m√≠nimo 04 portas USB 3.0;
  - Rede integrada Fast Ethernet Gigabite 10/100/1000;
  - Fonte de alimenta√ß√£o de 400W ou superior com PFC ativo e prote√ß√£o contra sub e sobre Tens√£o;
  - Sistema Operacional Windows 11 PRO.

---

## üîê Configura√ß√µes Iniciais de Seguran√ßa

### üîß Nomea√ß√£o do Switch
```bash
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname ITEP_SW01
ITEP_SW01(config)#
```

### üîí Senhas para acesso ao modo privilegiado, console e VTY (limitando acessos simult√¢neos) criptografadas
```bash
ITEP_SW01(config)#service password-encryption
ITEP_SW01(config)#enable secret It3P,9
ITEP_SW01(config)#line con 0
ITEP_SW01(config-line)#password CoN0_eLO$
ITEP_SW01(config-line)#login
ITEP_SW01(config-line)#exit
ITEP_SW01(config)#line vty 0 4
ITEP_SW01(config-line)#password v1R_Ty16!
ITEP_SW01(config-line)#login
ITEP_SW01(config-line)#^Z
ITEP_SW01#
%SYS-5-CONFIG_I: Configured from console by console

ITEP_SW01#wr
Building configuration...
Compressed configuration from 7383 bytes to 3601 bytes[OK]
[OK]
ITEP_SW01#
```

---

## üåê Configura√ß√£o de VLANs e Interfaces

```bash
ITEP_SW01(config)#ip routing
ITEP_SW01(config)#vlan 10
ITEP_SW01(config-vlan)#name TI
ITEP_SW01(config-vlan)#vlan 20
ITEP_SW01(config-vlan)#name ADM
ITEP_SW01(config-vlan)#vlan 30
ITEP_SW01(config-vlan)#name PESQ
ITEP_SW01(config-vlan)#vlan 100
ITEP_SW01(config-vlan)#name DATACENTER
```

### üñß Interfaces VLAN
```bash
ITEP_SW01(config-vlan)#interface vlan 10
ITEP_SW01(config-if)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up

ITEP_SW01(config-if)#ip address 192.168.10.1 255.255.255.0
ITEP_SW01(config-if)#no shutdown
ITEP_SW01(config-if)#interface vlan 20
ITEP_SW01(config-if)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up

ITEP_SW01(config-if)#ip address 192.168.20.1 255.255.255.0
ITEP_SW01(config-if)#no shutdown
ITEP_SW01(config-if)#interface vlan 30
ITEP_SW01(config-if)#
%LINK-5-CHANGED: Interface Vlan30, changed state to up

ITEP_SW01(config-if)#ip address 192.168.30.1 255.255.255.0
ITEP_SW01(config-if)#no shutdown
ITEP_SW01(config-if)#interface vlan 100
ITEP_SW01(config-if)#
%LINK-5-CHANGED: Interface Vlan100, changed state to up

ITEP_SW01(config-if)#ip address 192.168.100.1 255.255.255.0
ITEP_SW01(config-if)#no shutdown
ITEP_SW01(config-if)#end
ITEP_SW01#
%SYS-5-CONFIG_I: Configured from console by console

ITEP_SW01#wr
Building configuration...
Compressed configuration from 7383 bytes to 3601 bytes[OK]
[OK]
ITEP_SW01#
```

---

## üîå Atribui√ß√£o de Portas √†s VLANs

```bash
ITEP_SW01#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ITEP_SW01(config)#interface range gigabitEthernet1/0/1-3
ITEP_SW01(config-if-range)#switchport mode access
ITEP_SW01(config-if-range)#switchport access vlan 10
ITEP_SW01(config-if-range)#interface range gigabitethernet1/0/4-5
ITEP_SW01(config-if-range)#switchport mode access
ITEP_SW01(config-if-range)#switchport access vlan 20
ITEP_SW01(config-if-range)#interface range gigabitethernet1/0/6-7
ITEP_SW01(config-if-range)#switchport mode access
ITEP_SW01(config-if-range)#switchport access vlan 30
ITEP_SW01(config-if-range)#interface range gigabitethernet1/0/8
ITEP_SW01(config-if-range)#switchport mode access
ITEP_SW01(config-if-range)#switchport access vlan 100
ITEP_SW01(config-if-range)#
ITEP_SW01#
%SYS-5-CONFIG_I: Configured from console by console

ITEP_SW01#wr
Building configuration...
Compressed configuration from 7383 bytes to 3601 bytes[OK]
[OK]
ITEP_SW01#
```

---

## üö´ Configura√ß√£o e Aplica√ß√£o de ACLs

```bash
ITEP_SW01#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ITEP_SW01(config)#ip access-list extended ITEP-ACL
ITEP_SW01(config-ext-nacl)#! Permitir TI acessar o Datacenter
ITEP_SW01(config-ext-nacl)#permit ip 192.168.10.0 0.0.0.255 192.168.100.0 0.0.0.255
ITEP_SW01(config-ext-nacl)#! Bloquear Administrativo e Pesquisa de acessar o Datacenter
ITEP_SW01(config-ext-nacl)#deny ip 192.168.20.0 0.0.0.255 192.168.100.0 0.0.0.255
ITEP_SW01(config-ext-nacl)#deny ip 192.168.30.0 0.0.0.255 192.168.100.0 0.0.0.255
ITEP_SW01(config-ext-nacl)#! Bloquear comunicao entre Administrativo e Pesquisa
ITEP_SW01(config-ext-nacl)#deny ip 192.168.20.0 0.0.0.255 192.168.30.0 0.0.0.255
ITEP_SW01(config-ext-nacl)#deny ip 192.168.30.0 0.0.0.255 192.168.20.0 0.0.0.255
ITEP_SW01(config-ext-nacl)#! Permitir todo o restante (inclusive comunicao interna nas VLANs)
ITEP_SW01(config-ext-nacl)#permit ip any any
ITEP_SW01(config-ext-nacl)#exit
ITEP_SW01(config)#interface vlan 20
ITEP_SW01(config-if)#ip access-group ITEP-ACL in
ITEP_SW01(config-if)#interface vlan 30
ITEP_SW01(config-if)#ip access-group ITEP-ACL in
ITEP_SW01(config-if)#interface vlan 100
ITEP_SW01(config-if)#ip access-group ITEP-ACL in
ITEP_SW01(config-if)#^Z
ITEP_SW01#
%SYS-5-CONFIG_I: Configured from console by console

ITEP_SW01#wr
Building configuration...
Compressed configuration from 7383 bytes to 3601 bytes[OK]
[OK]
ITEP_SW01#
```

---

## üì¢ Banner de Aviso antes do login (MOTD)

```bash
ITEP_SW01#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ITEP_SW01(config)#banner motd #
Enter TEXT message.  End with the character '#'.
**************************
ITEP - ACESSO RESTRITO!!!
Somente Pessoal Autorizado
Ambiente Monitorado
**************************
#

ITEP_SW01(config)#^Z
ITEP_SW01#
%SYS-5-CONFIG_I: Configured from console by console

ITEP_SW01#wr
Building configuration...
Compressed configuration from 7383 bytes to 3601 bytes[OK]
[OK]
#
```

---

## üß≠ Configura√ß√£o de DHCP e DNS

### üîí Exclus√£o de IPs Reservados
```bash
ITEP_SW01#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ITEP_SW01(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.10
ITEP_SW01(config)#ip dhcp excluded-address 192.168.20.1 192.168.20.10
ITEP_SW01(config)#ip dhcp excluded-address 192.168.30.1 192.168.30.10
```

### üì¶ Pools DHCP por VLAN
```bash
ITEP_SW01(config)#! Pool para VLAN 10 - TI
ITEP_SW01(config)#ip dhcp pool TI
ITEP_SW01(dhcp-config)#network 192.168.10.0 255.255.255.0
ITEP_SW01(dhcp-config)#default-router 192.168.10.1
ITEP_SW01(dhcp-config)#dns-server 192.168.100.2
ITEP_SW01(dhcp-config)#! Pool para VLAN 20 - Administrativo
ITEP_SW01(dhcp-config)#ip dhcp pool ADM
ITEP_SW01(dhcp-config)#network 192.168.20.0 255.255.255.0
ITEP_SW01(dhcp-config)#default-router 192.168.20.1
ITEP_SW01(dhcp-config)#dns-server 192.168.100.10
ITEP_SW01(dhcp-config)#! Pool para VLAN 30  Pesquisa
ITEP_SW01(dhcp-config)#ip dhcp pool PESQ
ITEP_SW01(dhcp-config)#network 192.168.30.0 255.255.255.0
ITEP_SW01(dhcp-config)#default-router 192.168.30.1
ITEP_SW01(dhcp-config)#dns-server 192.168.100.2
ITEP_SW01(dhcp-config)#exit
ITEP_SW01(config)#^Z
ITEP_SW01#
%SYS-5-CONFIG_I: Configured from console by console

ITEP_SW01#wr
Building configuration...
Compressed configuration from 7383 bytes to 3601 bytes[OK]
[OK]
ITEP_SW01#
```

> **No Web_Server:** habilitar servi√ßo DNS e adicionar o registro `srv.itep.local` apontando para o IP do servidor.

---

## üì° Esquema de Endere√ßamento IP

---

## üß≠ Estrutura de VLANs e Sub-redes

| VLAN | Nome         | Finalidade              | Sub-rede             | Gateway (SVI)     | Faixa DHCP Din√¢mica     | IPs Reservados        |
|------|--------------|--------------------------|----------------------|-------------------|--------------------------|------------------------|
| 10   | TI           | Suporte t√©cnico e TI     | 192.168.10.0/24      | 192.168.10.1      | 192.168.10.11 ‚Äì 192.168.10.254 | 192.168.10.1 ‚Äì 192.168.10.10 |
| 20   | ADM          | Administrativo           | 192.168.20.0/24      | 192.168.20.1      | 192.168.20.11 ‚Äì 192.168.20.254 | 192.168.20.1 ‚Äì 192.168.20.10 |
| 30   | PESQ         | Pesquisa e desenvolvimento | 192.168.30.0/24      | 192.168.30.1      | 192.168.30.11 ‚Äì 192.168.30.254 | 192.168.30.1 ‚Äì 192.168.30.10 |
| 100  | DATACENTER   | Servidores e servi√ßos     | 192.168.100.0/24     | 192.168.100.1     | N√£o utiliza DHCP         | IPs fixos para servidores |

---

## üß† Observa√ß√µes T√©cnicas

- **Acesso ao Switch**: Cabo console USB, conex√£o via terminal (Drivers CISCO USB) no Notebook TI01.
- **Exclus√£o de IPs no DHCP**: IPs de `.1` a `.10` foram exclu√≠dos para evitar conflitos com gateways e permitir reservas manuais.
- **Servidores DNS**:
  - Interno: `192.168.100.2` ou `192.168.100.10`
  - Externo: `8.8.8.8` (Google DNS)
- **Servidor Web/DNS**: Localizado na VLAN 100 com IP fixo (`192.168.100.2`), configurado para responder por `srv.itep.local`.
- **Comandos de Verifica√ß√£o**:
```bash
show vlan brief
show ip interface brief
show ip route
show access-lists
```
- **OBS**: Todas as configura√ß√µes atendendo as melhores pr√°ticas de seguran√ßa (m√≠nimo privil√©gio, senhas fortes e documenta√ß√£o clara) atendendo demanda escal√°vel.

---

## üõ†Ô∏è Melhorias Adicionais/Futuras

### üö´ Desativar resolu√ß√£o autom√°tica de nomes inv√°lidos
```bash
no ip domain-lookup
```
√ötil para evitar que o switch tente resolver comandos digitados incorretamente como nomes de host via DNS, o que pode causar lentid√£o ou travamento na linha de comando.

## ‚òÅÔ∏è Alternativa Futura: Uso de Computa√ß√£o em Nuvem

Objetivo: Realizar cota√ß√£o e an√°lise de viabilidade para substituir o servidor local por uma solu√ß√£o em nuvem.

- Provedores recomendados: AWS, Microsoft Azure, Google Cloud
- Tipo de inst√¢ncia sugerida: VM com 2‚Äì4 vCPUs, 8‚Äì16 GB RAM, SSD 100 GB
- Sistema operacional: Linux Server (Ubuntu/Debian) ou Windows Server
- Servi√ßos: HTTP, DNS, opcionalmente FTP/HTTPS
- IP p√∫blico fixo ou DNS din√¢mico (ex: srv.itep.cloud)
- Seguran√ßa: firewall em n√≠vel de inst√¢ncia + regras de acesso restrito
- Backup: snapshots autom√°ticos ou armazenamento em bucket (S3, Blob)
- Monitoramento: uso de m√©tricas, alertas e logs integrados
- Custo estimado: entre R$ 150 e R$ 400/m√™s (dependendo do provedor e recursos)

**OBS**: A substitui√ß√£o do servidor f√≠sico por uma inst√¢ncia em nuvem pode reduzir custos com energia, manuten√ß√£o e espa√ßo f√≠sico, al√©m de aumentar a escalabilidade e disponibilidade do ambiente.

---



